of90/tutorials/rheoFoam/OtherTests/Channel2D_VE/FENE-P/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             FENE-P;

                rho              rho [1 -3 0 0 0 0 0] 1.;
                etaS             etaS [1 -1 -1 0 0 0 0] .01;
                etaP             etaP [1 -1 -1 0 0 0 0] .99;             
                lambda           lambda [0 0 1 0 0 0 0] .1;
                L2               L2 [0 0 0 0 0 0 0] 100;
                solveInTau       false;                

                stabilization    coupling;                    
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
